export const state = () => ({
	blog: [
	{	
		"id": 1,
		"title": "Заголовок 1",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-1",
		"created_at": "",
		"public_at": ""
	},
	{
		"id": 2,
		"title": "Заголовок 2",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-2",
		"created_at": "",
		"public_at": ""
	},
	{
		"id": 3,
		"title": "Заголовок 3",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-3",
		"created_at": "",
		"public_at": ""
	},
	{
		"id": 4,
		"title": "Заголовок 4",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-4",
		"created_at": "",
		"public_at": ""
	},
	{
		"id": 5,
		"title": "Заголовок 5",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-5",
		"created_at": "",
		"public_at": ""
	},
	{
		"id": 6,
		"title": "Заголовок 6",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-6",
		"created_at": "",
		"public_at": ""
	},
	{
		"id": 7,
		"title": "Заголовок 7",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-7",
		"created_at": "",
		"public_at": ""
	},
	{
		"id": 8,
		"title": "Заголовок 8",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-8",
		"created_at": "",
		"public_at": ""
	},
	{
		"id": 9,
		"title": "Заголовок 9",
		"preview": "http://placehold.it/1000x600",
		"discription": "Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта. Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.Любое взаимодействие с потребителем — коммуникация, дизайн, пользовательский опыт — создаёт образ продукта.",
		"content": "<p>Тело поста в виде HTML</p>",
		"slug": "article-slug-9",
		"created_at": "",
		"public_at": ""
	}
	]
})

export const mutations = {
	setPosts (state, blog) {
		state.blog = blog
	}
}

export const actions = {
	async fetch ({commit}) {
		const blog = await this.$axios.$get("https://api.myjson.com/bins/ebmos")
		commit('setPosts', blog)
	}
}

export const getters = {
	blog: s => s.blog,
	postById: s => id => {
		return s.blog.find(post => post.id === id);
	}
}