export const state = () => ({
	podcasts: [
	{
		id: 1,
		title: '1. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 2,
		title: '2. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 3,
		title: '3. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 4,
		title: '4. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 5,
		title: '5. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 6,
		title: '6. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 7,
		title: '7. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 8,
		title: '8. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 9,
		title: '9. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 10,
		title: '10. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 11,
		title: '11. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false
	},
	{
		id: 12,
		title: '12. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 13,
		title: '13. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 14,
		title: '14. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 15,
		title: '15. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 16,
		title: '16. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '30/01/1995',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		slug: 'unique-slug',
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	]
})

export const mutations = {
	setPodcasts (state, podcasts) {
		state.podcasts = podcasts
	}
}

export const actions = {
	async fetch ({commit}) {
		// Здесь указываем, откуда получать слайды, массив сверху должен быть пустым
		const podcasts = await this.$axios.$get("https://api.myjson.com/bins/18oqjg")
		commit('setPodcasts', podcasts)
	}
}

export const getters = {
	podcasts: s => s.podcasts,
	podcastsFront: s => s.podcasts.slice(-8).reverse(),
	podcastsPlayer: s => s.podcasts.slice(-5).reverse(),
	podcastsById: s => id => {
		return s.podcasts.find(podcasts => podcasts.id === id);
	}
}