export const state = () => ({
	podcasts: [
	{
		id: 1,
		title: '1. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 2,
		title: '2. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 3,
		title: '3. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 4,
		title: '4. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 5,
		title: '5. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 6,
		title: '6. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 7,
		title: '7. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 8,
		title: '8. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 9,
		title: '9. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 10,
		title: '10. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 11,
		title: '11. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 12,
		title: '12. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 13,
		title: '13. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 14,
		title: '14. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 15,
		title: '15. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	{
		id: 16,
		title: '16. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
		content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
	},
	],
	podcastsFront: [
	{
		id: 1,
		title: '1. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
	},
	{
		id: 2,
		title: '2. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
	},
	{
		id: 3,
		title: '3. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
	},
	{
		id: 4,
		title: '4. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
	},
	{
		id: 5,
		title: '5. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
	},
	{
		id: 6,
		title: '6. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
	},
	{
		id: 7,
		title: '7. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
	},
	{
		id: 8,
		title: '8. Очень длинное и сложноепроизносимое название хорошего подкаста',
		date: '1555065432',
		info: 'Краткое описание подкаста для отображения под заголовком',
		time: '25:15',
		thumb: 'http://placehold.it/1000x600',
		play: false,
	},
	]
})

export const mutations = {
	setPodcasts (state, podcasts) {
		state.podcasts = podcasts
	},
	setPodcastsFront (state, podcastsFront) {
		state.podcastsFront = podcastsFront
	}
}

export const actions = {
	async fetch ({commit}) {
		const podcasts = await this.$axios.$get("/api/podcasts")
		commit('setPodcasts', podcasts)
	},
	async fetchFront ({commit}) {
		const podcastsFront = await this.$axios.$get("/podcasts?front")
		commit('setPodcastsFront', podcastsFront)
	}
}

export const getters = {
	podcasts: s => s.podcasts,
	podcastsFront: s => s.podcastsFront,
	podcastsPlayer: s => s.podcastsFront.slice(0, 4),
	podcastsById: s => id => {
		return s.podcasts.find(podcasts => podcasts.id === id);
	}
}