export const state = () => ({
	podcasts: {
		items: [
		{
			id: 1,
			title: '1. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNA.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 2,
			title: '2. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNC.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 3,
			title: '3. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNF.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 4,
			title: '4. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNA.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 5,
			title: '5. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNC.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 6,
			title: '6. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNF.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 7,
			title: '7. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNA.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 8,
			title: '8. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNC.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 9,
			title: '9. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNF.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 10,
			title: '10. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNA.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 11,
			title: '11. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNC.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 12,
			title: '12. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNF.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 13,
			title: '13. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNA.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 14,
			title: '14. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNC.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 15,
			title: '15. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNF.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		{
			id: 16,
			title: '16. Очень длинное и сложноепроизносимое название хорошего подкаста',
			date: 1555065432,
			info: 'Краткое описание подкаста для отображения под заголовком',
			time: '25:15',
			thumb: 'http://placehold.it/1000x600',
			play: false,
			link: 'http://d.zaix.ru/gQNA.mp3',
			content: '<p>- Калининградцы рассказали о проблемах, с которыми сталкиваются в поликлиниках;</p><p>- В прокуратуре Московского района Калининграда назвали самую коррумпированную государственную структуру;</p><p>- Судьба 300 тонн инженерного наследия решается в Калининграде;</p>'
		},
		],
		pages: {
			current: 1,
			max: 3
		}
	},
	podcastsFront: [
	// {
	// 	id: 1,
	// 	title: '1. Очень длинное и сложноепроизносимое название хорошего подкаста',
	// 	date: 1555065432,
	// 	info: 'Краткое описание подкаста для отображения под заголовком',
	// 	time: '25:15',
	// 	thumb: 'http://placehold.it/1000x600',
	// 	play: false,
	// 	link: 'http://d.zaix.ru/gQNF.mp3',
	// },
	]
})

export const mutations = {
	setPodcasts (state, podcasts) {
		state.podcasts = podcasts
		state.podcasts.play = false
		console.log(state.podcasts)
	},
	setPodcastsFront (state, podcastsFront) {
		state.podcastsFront = podcastsFront
		state.podcastsFront.play = false
	},
	changePodcast (state, payload) {
		for (let i = 0; i < state.podcasts.items.length; i++) {
			state.podcasts.items[i].play = false;
		}
		// дописать аналогичный для front-версии
		let podcast = state.podcasts.items.find(podcasts => podcasts.id === payload);
		podcast.play = !podcast.play;
		// дописать аналогичный для front-версии
	},
}

// Пример полного запроса, любой из параметров может отсутствовать
// http://localhost:8000/api/podcasts?dateStart=1578078000000&dateEnd=1578423600000&genre=7&page=1
export const actions = {
	async fetch ({commit}) {
		let podcasts = await this.$axios.$get("/api/podcasts", {
			params: {
				page: 1,
				front: false
			}
		})
		.then( response => {
			commit('setPodcasts', podcasts)
		})
		.catch((e) => {
			console.log(e)
		})
	},
	async fetchCustom ({commit}, payload) {
		let podcasts = await this.$axios.$get("http://89.108.65.88/api/v1/podcasts", {
			params: {
				dateStart: payload.dateStart || null,
				dateEnd: payload.dateEnd || null,
				genre: payload.genre || null,
				page: payload.page || null,
			}
		})
		.then( response => {
			commit('setPodcasts', podcasts)
		})
		.catch((e) => {
			console.log(e)
		})
	},
	async fetchFront ({commit}) {
		let podcastsFront = await this.$axios.$get("http://89.108.65.88/api/v1/podcasts", {
			params: {
				front: true
			}
		})
		.then( response => {
			commit('setPodcastsFront', response.podcasts.items)
		})
		.catch((e) => {
			console.log(e)
		})
	}
}

export const getters = {
	podcasts: s => s.podcasts,
	podcastsFront: s => s.podcastsFront,
	podcastsPlayer: s => s.podcastsFront.slice(0, 4),
	podcastsById: s => id => {
		return s.podcasts.items.find(podcasts => podcasts.id === id);
	}
}