export const state = () => ({
	// Программ немного, поэтому постраничная пагинация нам не нужна
	programs: [
	{	
		id: 1,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	{	
		id: 2,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
	},
	{	
		id: 3,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
	},
	{	
		id: 4,
		title: 'Обед на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: "",
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	{	
		id: 5,
		title: 'Вечера на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	{	
		id: 6,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	{	
		id: 7,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	{	
		id: 8,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41]
	},
	{	
		id: 9,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
	},
	{	
		id: 10,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
	},
	{	
		id: 11,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
	},
	{	
		id: 12,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	{	
		id: 13,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	{	
		id: 14,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	{	
		id: 15,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
	},
	{	
		id: 16,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
		podcasts: [41, 14, 41, 53, 63, 78]
	},
	],
	programsFront: [
	{	
		id: 1,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432
	},
	{	
		id: 2,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432
	},
	{	
		id: 3,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432
	},
	{	
		id: 4,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432,
	},
	{	
		id: 5,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432
	},
	{	
		id: 6,
		title: 'Утро на Балтик Плюс',
		preview: 'http://placehold.it/1000x1000',
		text: 'Вы ищете текст любимой песни? У нас вы найдете слова и перевод любимых зарубежных песен 70 х 80 х 90 х и 2000 х на русский язык, а также истории и интересные факты о создании музыкальных хитов. Читайте и слушайте онлайн на "Радио 7 на семи холмах".',
		time: '17:00-21:00 (Пн-Пт)',
		slug: "program-slug-1",
		link: "http://bp.koenig.ru:8000/Baltic_Plus_mp3_128.mp3",
		author: "Артём Королёв",
		public_at: 1555065432
	}
	]
})

export const mutations = {
	setPrograms (state, programs) {
		state.programs = programs
	},
	setProgramsFront (state, programsFront) {
		state.programsFront = programsFront
	}
}

export const actions = {
	async fetch ({commit}) {
		const programs = await this.$axios.$get("/api/programs/")
		commit('setPrograms', programs)
	},
	async fetchFront ({commit}) {
		const programsFront = await this.$axios.$get("/api/programs?front")
		commit('setProgramsFront', programsFront)
	}
}

export const getters = {
	programs: s => s.programs,
	programsFront: s => s.programsFront,
	programsList: s => s.programs.filter(todo => todo.podcasts),
	programsById: s => id => {
		return s.programs.find(post => post.id === id);
	}
}