export const state = () => ({
	shedule: [
	{
		day: 1,
		title: 'Понедельник',
		table: [
			{
				time: '00:00 - 07:00',
				title: '"1 Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '07:00 - 08:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '08:00 - 09:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '10:00 - 11:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '11:00 - 12:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '12:00 - 16:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
		]
	},
	{
		day: 2,
		title: 'Вторник',
		table: [
			{
				time: '00:00 - 07:00',
				title: '"2 Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '07:00 - 08:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '08:00 - 09:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '10:00 - 11:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '11:00 - 12:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '12:00 - 16:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
		]
	},
	{
		day: 3,
		title: 'Среда',
		table: [
			{
				time: '00:00 - 07:00',
				title: '"3 Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '07:00 - 08:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '08:00 - 09:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '10:00 - 11:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '11:00 - 12:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '12:00 - 16:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
		]
	},
	{
		day: 4,
		title: 'Четверг',
		table: [
			{
				time: '00:00 - 07:00',
				title: '"4 Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '07:00 - 08:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '08:00 - 09:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '10:00 - 11:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '11:00 - 12:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '12:00 - 16:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
		]
	},
	{
		day: 5,
		title: 'Пятница',
		table: [
			{
				time: '00:00 - 07:00',
				title: '"5 Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '07:00 - 08:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '08:00 - 09:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '10:00 - 11:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '11:00 - 12:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '12:00 - 16:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
		]
	},
	{
		day: 6,
		title: 'Сентября',
		table: [
			{
				time: '00:00 - 07:00',
				title: '"6 Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '07:00 - 08:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '08:00 - 09:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '10:00 - 11:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '11:00 - 12:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '12:00 - 16:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
		]
	},
	{
		day: 7,
		title: 'Воскресенье',
		table: [
			{
				time: '00:00 - 07:00',
				title: '"7 Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '07:00 - 08:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '08:00 - 09:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '10:00 - 11:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '11:00 - 12:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
			{
				time: '12:00 - 16:00',
				title: '"Музыка на все времена. Музыкальная программа Музыкальная программа"',
				authors: 'Ева Корсакова, Рубен Акопян'
			},
		]
	}
	]
})

export const mutations = {
	setShedule (state, shedule) {
		state.shedule = shedule
	}
}

export const actions = {
	async fetch ({commit}) {
		// Здесь указываем, откуда получать слайды, массив сверху должен быть пустым
		const shedule = await this.$axios.$get("https://api.myjson.com/bins/18oqjg")
		commit('setShedule', shedule)
	}
}

export const getters = {
	shedule: s => s.shedule
}